Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/distutils.tmx
Source language: en
Languages: pt

source: API Reference
pt: Referência da API

source: :mod:`distutils.core` --- Core Distutils functionality
pt: :mod:`distutils.core` --- Núcleo de funcionalidades Distutils

source: *name*
pt: *nome*

source: *version*
pt: *versão*

source: The version number of the package
pt: O número da versão do pacote

source: See :mod:`distutils.version`
pt: Veja :mod:`distutils.version`

source: *description*
pt: *descrição*

source: *long_description*
pt: *descrição_detalhada*

source: The email address of the package author
pt: O endereço de email do autor do pacote

source: *maintainer*
pt: *mantenedor*

source: The name of the current maintainer, if different from the author
pt: O nome do mantenedor corrente, se diferente do autor

source: *maintainer_email*
pt: *email_mantenedor*

source: The email address of the current maintainer, if different from the author
pt: O endereço de email do mantenedor corrente, se diferente do autor

source: A URL for the package (homepage)
pt: Uma URL para o pacote (homepage)

source: *download_url*
pt: *url_download*

source: A URL to download the package
pt: Uma URL para baixar o pacote

source: *packages*
pt: *pacotes*

source: A list of Python packages that distutils will manipulate
pt: Uma lista de pacotes que o distutils manipulará

source: a list of strings
pt: uma lista de strings

source: *py_modules*
pt: *módulos_py*

source: A list of Python modules that distutils will manipulate
pt: Uma lista de módulos Python que o distutils manipulará

source: *ext_modules*
pt: *módulos_ext*

source: A list of Python extensions to be built
pt: Uma lista de extensões Python a serem construídas

source: A list of instances of :class:`distutils.core.Extension`
pt: Uma lista de instâncias da :class:`distutils.core.Extension`

source: A list of categories for the package
pt: Uma lista de categorias para o pacote

source: the :class:`Distribution` class to use
pt: a classe :class:`Distribution` para usar
